1. Каков общий синтаксис многоступенчатой конструкции if-else-if?

Ответ:
if (условие) {
	//оператор
} else {       //else не является обязательным после if
	//оператор
}

и
if (условие) {
	//оператор
} else if (условие) {
	//оператор
}

2. Допустим, имеется следующий фрагмент кода.
if(x < 10)
    if(y > 100) {
        if ( ! done) х z;
        else у= z;
    }
else System.out.println("error"); // к какому оператору if относится?

С каким из операторов if связан последний оператор else?

Ответ: Последний оператор else принадлежит ближайшему к нему оператору if который без него, то есть к if(y > 100).

3. Корректен ли следующий фрагмент кода?
for(int i = О; i < num; i++)
    sum += i;

count = i; 

Ответ: Нет. Переменная "i" объявлена в цикле и ее область видимости ограничена самим циклом, за его пределами она не существует.

4. Какие действия выполняет оператор break? Опишите оба варианта этого оператора

Ответ: Служит для досрочного выхода из цикла, в результате чего исполнение передается следующему после цикла оператору. Но только при условии, что break используется без метки. С меткой же управление передается тому участку кода, где она стоит. Метка обязательно должна быть объявлена вместе с оператом break в одном блоке кода, содержащем этот оператор.

for (int i = 0, i < 5; i++) {
	//оператор
	if (условие) break;
}

и

for (int i = 0, i < 5; i++) one: {
	for (int j = 0; j < 10; j++) {
	    if (условие) break one;
	}
}

Второй вариант использования оператора break, для выхода из кейса (case) оператора ветвления switch.

5. Какое сообщение будет выведено после выполнения оператора break в приведенном
ниже фрагменте кода?
for(i = О; i < 10; i++) {
    while(running) {
        if (х<у) break;
            // ...
    }
    System.out.println("Пocлe while");
}
System.out.println("Пocлe for");

Ответ: Первым на экран будет выведено сообщение "Пocлe while"

6. Что будет выведено на экран в результате выполнения следующего фрагмента
кода?
for (int i = 0; i < 10; i++) {
    System.out.print(i +" ");
    if((i%2) == 0) continue;
    System.out.println();
}

Ответ:
0 1
2 3
4 5
6 7
8 9

7. Что такое бесконечный цикл?

Ответ: Бесконечный цикл - это цикл, не имеющий условия выхода. Такими циклами может быть пустой цикл:
for (;;) {
    //оператор
}
или цикл с пропущенным условием выхода в условии и без него внутри цикла:
for (int i = 0; ; i++) {
    //оператор
}

8. Должна ли метка, используемая вместе с оператором break, быть определена в
блоке кода, содержащем этот оператор?

Ответ: да.
